<template>
  <el-table :data="tableData" style="width: 100%" height="450">
    <el-table-column fixed  prop="date" label="阎王殿" width="180" />
    <el-table-column prop="name" label="阎王" width="180" />
    <el-table-column prop="address" label="简介" />
  </el-table>
</template>

<script lang="ts" setup>
const tableData = [
  {
    date: '第一殿',
    name: '秦广王蒋',
    address: '二月初一诞辰，司人间天寿生死，统管幽冥凶吉。善人寿终，接引超生。功过两半者，交送第十殿发放，仍投人世，男转为女，女转为男。恶多善少者，押赴殿右高台，名曰孽镜台，令之一望，照见在世之心好歹，随即批解第二殿，发狱受苦。',
  },
  {
    date: '第二殿',
    name: '楚江王历',
    address: '三月初一诞辰。楚江王的前世是东汉末年义阳侯厉温，涿郡涿县（河北涿州）人，魏郡太守。汉灵帝中平元年（公元184年）2月，黄巾军领袖张角组织大批教徒在邺城（邯郸临漳）集结，准备起义，被厉温率军配合卢植、皇甫嵩平叛。魏文帝黄初年间，曹丕设立义阳郡，厉温被封为义阳侯，世袭侯爵。厉温为官清正，被玉皇大帝敕封为“第二殿阎罗楚江王”，管理大地狱，又被称为剥衣亭寒冰地狱，除此之外还建立了16座小狱。楚江王光明正大，凡生前利用权位、巧取豪夺、鱼肉百姓、欺占拐骗、逼良为娼、走私贩毒、非法骗婚、伪造证券、扰乱秩序、贩卖假药等违伦常、乱法纪、造孽无数的恶魂，将被推入火山，被滚烫的岩浆吞没；或被丢到寒冰池，饱受冰冻之苦。',
  },
  {
    date: '第三殿',
    name: '宋帝王余',
    address: '二月初八日诞辰，专司黑绳大地狱。宋帝王的前世是唐朝工部尚书余懃，江西余干人。余懃天资聪颖，学习刻苦。唐中宗神龙元年（公元705年）高中进士，勋封上柱国。余懃为官清廉，体恤民情，为百姓办了不少实事，被玉皇大帝敕封为“第三殿阎王宋帝王”。专司在阳间忤逆尊长、背信弃义、教唆兴讼等罪。 宋帝王的形象为横眉瞪眼，双手于胸前捧笏。宋帝王性情仁孝，嫉恶如仇，对散播歪理邪说、越狱盗墓、贩毒吸毒、诱人犯法、忘恩负义、不敬长辈、嗜杀成性、教唆兴讼者，绝不宽恕，受开膛剜心、炮烙、倒吊、挖眼、刮骨之刑。',
  },
  {
    date: '第四殿',
    name: '五官王吕',
    address: '农历二月十八日诞辰。五官王的前世是三国时期孙权的托孤大臣吕岱，吕岱一生戮力奉公，兢兢业业为孙吴开疆拓土，战功赫赫，死后被玉皇大帝敕封为“第四殿阎罗仵官王”。司掌合大地狱，又名剥剹血池地狱，凡世人抗粮赖租，交易欺诈者，推入此狱，另再判以小狱受苦，满日送解第五殿察核。五官王的形象是皱眉瞪眼，连耳长鬓，头戴方冠，身穿长袍，左手在膝前握一个念珠，右手持笏放在膝间。',
  },
  {
    date: '第五殿',
    name: '阎罗王天子包',
    address: '正月初八日诞辰，司掌大海之底，东北方沃礁石下的“叫唤大地狱”，另设十六小地狱，传说阎罗天子的前世是包拯。阎罗王的形象是白净面孔，头戴冕旒，两侧垂香袋护耳，身穿荷叶边翻领宽袖长袍，双足着靴，双手在胸前捧笏，正襟危坐。阎罗王是十王之中在中国最为人所知的，凡生前不信因果、阻人行善、谋财害命、诽僧谤道、放高利贷者，将被丢到刀山，刀剑插入四肢和胸膛，或剜出其心，铡其首级，掷与蛇食。',
  },
  {
    date: '第六殿',
    name: '卞城王毕',
    address: '三月初八诞辰，司掌大叫唤大地狱及枉死城，另设十六小狱。凡世人怨天尤地、对北溺便涕泣者，发入此狱，查所犯事件，应发何小狱受苦。满日转解第七殿，再查有无别恶。',
  },
  {
    date: '第七殿',
    name: '泰山王董',
    address: '三月二十七诞辰，司掌热恼地狱，又名碓磨肉酱地狱，另设十六小狱。凡阳世取骸合药、离人至戚者，发入此狱，再发何重小狱。受苦日满，转解第八狱，收狱查台。',
  },
  {
    date: '第八殿',
    name: '都主王黄',
    address: '四月初一诞辰，司掌大热恼大地狱，又名热恼闷锅地狱，另设十六小狱。凡在世不孝、使父母翁姑愁闷烦恼者，掷入此狱，再交各小狱加刑。受尽痛苦，解交第十殿，改头换面，永为畜类。发狱受苦。',
  },
  {
    date: '第九殿',
    name: '平等王陆',
    address: '四月初八诞辰，司掌丰都城铁网阿鼻地狱，另设十六小狱。凡阳世杀人放火、斩绞正法者，解到本殿，用空心钢柱炼其手足相抱，煽火焚烧，烫烬心府，随发阿鼻地狱受刑，直到被害者个个投生，方准提出，解交第十殿发生六道。',
  },
  {
    date: '第十殿',
    name: '转轮王薛',
    address: '四月十七诞辰，专司各殿解到鬼魂，分别善恶，核定等级。发四大部洲投生。男女寿天，富贵贫贱，逐名详细开载，每月汇知第一殿注册。凡有作孽极恶之鬼，着令更变胎卵湿化，朝生暮死。罪满之后，再复人生，投胎蛮夷之地。凡发往投生者，先令押交孟婆神，忘台下，灌饮汤，使忘前生之事。',
  },
]
</script>
